<template>
  <footer class="footer">
    <div class="container">
      <div class="footer-contacts">
        <div class="footer-adress">
          <svg width="26" height="31" viewBox="0 0 26 31" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M21.2233 16.6003C21.2729 16.5201 21.3263 16.4322 21.3987 16.3214C21.4098 16.3089 21.4188 16.2947 21.4254 16.2794C21.5588 16.0311 21.7609 15.6681 21.7723 15.649C22.5844 14.0627 23.0053 12.3046 23 10.5218C23 10.3282 23 10.1372 23 9.94873C23 9.86468 23 9.78445 23 9.70422L22.9695 9.55139C22.9695 9.4979 22.9695 9.44442 22.9695 9.39857C22.9695 9.35272 22.9695 9.26103 22.9504 9.19608V9.0509L22.9276 8.84077C22.9276 8.78728 22.9276 8.73379 22.9009 8.68031L22.878 8.53895C22.878 8.45871 22.8551 8.3823 22.8399 8.30589C22.8246 8.22948 22.817 8.17981 22.8056 8.11868L22.7712 7.95058C22.7712 7.89327 22.7484 7.83596 22.7331 7.77865C22.7179 7.72135 22.695 7.61437 22.6721 7.53414L22.5882 7.38132V7.25906C22.5654 7.17119 22.5349 7.08331 22.5082 6.99544L22.4548 6.877C22.4444 6.83557 22.4316 6.79475 22.4167 6.75475C22.39 6.66687 22.3557 6.579 22.3252 6.49495L22.2832 6.38415C22.2715 6.34389 22.2575 6.30434 22.2413 6.26571C22.207 6.1702 22.165 6.07851 22.1269 5.98299L22.0812 5.87984L22.0468 5.79196C21.9897 5.66589 21.9286 5.54363 21.8676 5.40991L21.8257 5.34878C21.7647 5.22652 21.6999 5.10808 21.6198 4.96672L21.5893 4.90942C21.5169 4.78334 21.4406 4.66108 21.3529 4.52736L21.3263 4.48915C21.2462 4.3669 21.1661 4.24464 21.0746 4.1071L21.0479 4.06889C20.9564 3.94281 20.8649 3.82056 20.7696 3.70594L20.7467 3.67538C20.6476 3.5493 20.5447 3.42704 20.4303 3.29332C20.3159 3.1596 20.2092 3.05263 20.0948 2.93801C18.1846 1.01245 15.5577 0 12.5 0C6.31972 0 2 4.32487 2 10.5218C1.99965 12.4359 2.48509 14.3185 3.41068 15.9929L3.57081 16.2832C3.56955 16.2946 3.56955 16.3062 3.57081 16.3176L3.83388 16.7226C3.86438 16.7684 3.89107 16.8143 3.90632 16.8334L10.6432 28.146L12.1988 30.7708C12.2402 30.8403 12.2988 30.8979 12.3689 30.9381C12.439 30.9783 12.5183 30.9996 12.5991 31C12.68 30.9981 12.7592 30.9757 12.8292 30.935C12.8991 30.8942 12.9577 30.8364 12.9995 30.7669L14.5245 28.146L21.0632 16.8487C21.1242 16.7646 21.1699 16.6844 21.2233 16.6003ZM18.3943 10.6403C18.3943 10.6976 18.3943 10.751 18.3715 10.8045L18.3486 10.9459C18.3486 11.0414 18.3257 11.1369 18.3066 11.2324C18.2876 11.328 18.2723 11.3738 18.2533 11.4464L18.2151 11.5992C18.2151 11.6642 18.1808 11.7329 18.1618 11.7979C18.1427 11.8628 18.1008 11.9736 18.0664 12.0615L18.0169 12.199C18.0169 12.2449 17.9826 12.2946 17.9635 12.3404C17.9178 12.4512 17.8644 12.5543 17.811 12.6613L17.7653 12.753C17.7498 12.7898 17.7319 12.8255 17.7119 12.86C17.6432 12.9937 17.5632 13.1198 17.4831 13.2421L17.4183 13.3452C17.3268 13.4789 17.2277 13.6126 17.1247 13.7273C17.1136 13.7483 17.0994 13.7676 17.0828 13.7846C16.9634 13.9266 16.8361 14.0618 16.7015 14.1895C16.1566 14.7464 15.5073 15.19 14.7908 15.4949C14.0744 15.7997 13.305 15.9599 12.5267 15.9661H12.4695C10.9206 15.9268 9.44842 15.2826 8.36683 14.1709C7.28524 13.0593 6.67989 11.5682 6.67989 10.0156C6.67989 8.46302 7.28524 6.97189 8.36683 5.86024C9.44842 4.74859 10.9206 4.1044 12.4695 4.06507H12.5305C14.0938 4.07784 15.5883 4.71121 16.6863 5.82635L16.7092 5.85309C16.8344 5.9737 16.9528 6.10125 17.0637 6.23515C17.0776 6.25076 17.0904 6.26736 17.1019 6.28482C17.2086 6.41854 17.3077 6.55226 17.3992 6.6898C17.4179 6.71377 17.4345 6.73934 17.4488 6.76621C17.5441 6.91903 17.6242 7.04511 17.6966 7.17501C17.7157 7.21321 17.7309 7.2476 17.7462 7.2858L17.7691 7.33165C17.8377 7.46919 17.8949 7.57998 17.9444 7.6946C17.9444 7.74045 17.9826 7.79394 17.9978 7.8436L18.0474 7.97732C18.0817 8.0652 18.1122 8.14925 18.1427 8.23712C18.1732 8.32499 18.177 8.37084 18.1961 8.43961L18.2304 8.58861C18.2533 8.66248 18.2723 8.73507 18.2876 8.80638C18.2876 8.89808 18.3181 8.99359 18.3295 9.08911L18.3524 9.23047C18.3524 9.28395 18.3715 9.34126 18.3753 9.39475C18.3943 9.59342 18.4058 9.79973 18.4058 10.0022C18.4058 10.2047 18.3943 10.4416 18.3943 10.6403Z" fill="#BEA8D7"/></svg>
          <p>г. Подольск, Лобачева 14</p>
        </div>
        <a class="footer-number" href="tel: +7 495 727-73-76">+7 495 727-73-76</a>
        <div>
          <div class="footer-email">
            <svg width="28" height="21" viewBox="0 0 28 21" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_172_118)"><path d="M0.0555132 18.8719L12.3154 11.1257L0 3.33252V18.4148C0.0023446 18.5687 0.0209525 18.7219 0.0555132 18.8719Z" fill="#BEA8D7"/><path d="M12.8577 11.4678L0.260498 19.4404C0.417019 19.7534 0.656129 20.0176 0.951938 20.2044C1.24775 20.3911 1.58898 20.4934 1.9387 20.5H26.0485C26.4289 20.4955 26.7997 20.3793 27.1147 20.1659C27.4297 19.9524 27.6752 19.6512 27.8207 19.2994L15.4797 11.4678L14.1687 12.3009L12.8577 11.4678Z" fill="#BEA8D7"/><path d="M28 18.415V3.54639L16.0433 11.126L28 18.6927C28.0063 18.6003 28.0063 18.5075 28 18.415Z" fill="#BEA8D7"/><path d="M1.93868 0.5C1.4059 0.518933 0.902427 0.74873 0.538902 1.13889C0.175377 1.52906 -0.018461 2.04766 -1.50664e-05 2.58075V2.6363L14.1687 11.6087L28 2.85847V2.58075C28.0085 2.31589 27.9648 2.05193 27.8713 1.80398C27.7779 1.55603 27.6365 1.32894 27.4552 1.1357C27.274 0.942453 27.0565 0.786845 26.8151 0.677768C26.5737 0.568691 26.3132 0.508284 26.0485 0.5L1.93868 0.5Z" fill="#BEA8D7"/></g><defs><clipPath id="clip0_172_118"><rect width="28" height="20" fill="white" transform="translate(0 0.5)"/></clipPath></defs></svg>
            <a href="email:info@cyberlink.com">info@cyberlink.com</a>
          </div>
          <div class="footer-email">
            <svg width="28" height="21" viewBox="0 0 28 21" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_172_118)"><path d="M0.0555132 18.8719L12.3154 11.1257L0 3.33252V18.4148C0.0023446 18.5687 0.0209525 18.7219 0.0555132 18.8719Z" fill="#BEA8D7"/><path d="M12.8577 11.4678L0.260498 19.4404C0.417019 19.7534 0.656129 20.0176 0.951938 20.2044C1.24775 20.3911 1.58898 20.4934 1.9387 20.5H26.0485C26.4289 20.4955 26.7997 20.3793 27.1147 20.1659C27.4297 19.9524 27.6752 19.6512 27.8207 19.2994L15.4797 11.4678L14.1687 12.3009L12.8577 11.4678Z" fill="#BEA8D7"/><path d="M28 18.415V3.54639L16.0433 11.126L28 18.6927C28.0063 18.6003 28.0063 18.5075 28 18.415Z" fill="#BEA8D7"/><path d="M1.93868 0.5C1.4059 0.518933 0.902427 0.74873 0.538902 1.13889C0.175377 1.52906 -0.018461 2.04766 -1.50664e-05 2.58075V2.6363L14.1687 11.6087L28 2.85847V2.58075C28.0085 2.31589 27.9648 2.05193 27.8713 1.80398C27.7779 1.55603 27.6365 1.32894 27.4552 1.1357C27.274 0.942453 27.0565 0.786845 26.8151 0.677768C26.5737 0.568691 26.3132 0.508284 26.0485 0.5L1.93868 0.5Z" fill="#BEA8D7"/></g><defs><clipPath id="clip0_172_118"><rect width="28" height="20" fill="white" transform="translate(0 0.5)"/></clipPath></defs></svg>
            <a href="email:info@cyberlink.com">info@cyberlink.com</a>
          </div>
        </div>
      </div>

      <div class="footer-menu">
        <div class="footer-menu-item" v-for="item in menuItems">
         <NuxtLink class="footer-menu-link" :to="item.linkTo" >{{ item.title }}</NuxtLink>
         <div class="footer-submenu" v-if="item.submenu">
           <ul v-for="list in item.submenu">
            <h4>{{list.title}}</h4>
            <li v-for="link in list.links">{{ link }}</li>
           </ul>
         </div>
        </div>
      </div>

      <div class="footer-safety">
        <p>Мы заботимся о вас и безопасности ваших покупок!</p>
        <div>
          <img src="@/assets/img/mcafee.png" alt="mcafee">
          <img src="@/assets/img/trusre.png" alt="trusre">
          <img src="@/assets/img/norton.png" alt="norton">
        </div>
      </div>
    </div>
  </footer>
</template>
<script>
  export default {
    data(){
      return{
        menuItems: [
          {
            title: "Каталог",
            linkTo: "/catalog",
            submenu: [
              {
                title: 'Серверы',
                links: [
                  'Напольные серверы',
                  'Блейд-серверы',
                  'Стоечные серверы'
                ]
              },
              {
                title: 'Системы хранения данных',
                links: [
                  'Дисковые системы хранения',
                  'Ленточные системы хранения',
                  'Дисковые полки',
                  'Сетевые системы хранения',
                  'Массивы хранения данных',
                  'Системы хранения с прямым подключением',
                  'Системы хранения на базе флеш-технологий',
                  'Корпоративные унифицированные системы хранения'
                ]
              },
              {
                title: 'Сетевое оборудование',
                links: [
                  'Коммутаторы',
                  'Маршрутизаторы',
                  'Беспроводные технологии',
                  'Точки доступа',
                  'Контроллеры'
                ]
              },
              {
                title: 'Компьютерная периферия',
                links: [
                  'Принтеры',
                  'Сканеры',
                  'МФУ',
                  'Жесткие диски',
                  'Ноутбуки',
                  'Мониторы',
                  'Компьютеры'
                ]
              }
            ]
          },
          {
            title: "О нас",
            linkTo: "/about-us"
          },
          {
            title: "Контакты",
            linkTo: "/contacts"
          },
          {
            title: "Гарантия",
            linkTo: "/warranty"
          },
          {
            title: "оформление заказа",
            linkTo: "/ordering"
          }
        ]
      }
    }
  }
</script>
<style lang="scss" scoped>
.footer {
  padding: 60px 0;
  &-contacts {
    margin-bottom: 60px;
    @media(min-width:768px){
      display: flex;
      align-items: center;
      justify-content: space-between;
    }
  }
  &-adress {
    font-weight: 400;
    font-size: 18px;
    line-height: 25px;
    color: #725E89;
    display: flex;
    svg {
      margin-right: 10px;
    }
  }
  &-number {
    display: block;
    font-weight: 600;
    font-size: 18px;
    line-height: 44px;
    color: #725E89;
    text-decoration: none;
    transition: 0.5s ease;
    margin: 10px 0;
    @media(min-width:768px){
      margin: 0;
    }
    @media(min-width:992px){
      font-size: 32px;
    }
    &:hover,
    &:active {
      color: #DBB3FE;
    }
  }
  &-email {
    display: flex;
    margin-bottom: 10px;
    &:last-child {
      margin-bottom: 0;
    }
    svg {
      margin-right: 10px;
    }
    a {
      font-weight: 400;
      font-size: 18px;
      line-height: 25px;
      color: #2A0E49;
      text-decoration: none;
      transition: 0.5s ease;
      &:hover,
      &:active {
        color: #DBB3FE;
      }
    }
  }
  &-menu {
    @media(min-width:1200px){
      display: grid;
      grid-template-columns: repeat(4, 1fr);
      gap: 0 22px;
    }
    &-item {
      &:first-child {
        grid-column: 1/6;
        grid-row: 1/2;
      }
      &:nth-child(2),
      &:nth-child(3){
        grid-row: 2/3;
      }
      &:nth-child(4),
      &:nth-child(5){
        @media(min-width:768px){
          grid-row: 2/3;
        }
        @media(min-width:1200px){
          grid-row: 3/4;
        }
      }
    }
  }
  &-submenu {
    margin: 40px 0;
    @media(min-width:768px){
      display: flex;
      flex-wrap: wrap;
      justify-content: space-between;
    }
    @media(min-width:1200px){
      flex-wrap: nowrap;
    }
    &>ul {
      margin-bottom: 20px;
      &:last-child {
        margin-bottom: 0;
      }
      @media(min-width:768px){
        flex: 1 calc(50% - 11px);
        max-width: calc(50% - 11px);
        margin-bottom: 30px;
      }
      @media(min-width:1200px){
        flex: 1 calc(33.33% - 11px);
        max-width: calc(33.33% - 11px);
        margin-bottom: 0;
      }
    }
  }
  &-menu-link{
    margin-bottom: 20px;
    font-weight: 700;
    font-size: 20px;
    line-height: 27px;
    text-transform: uppercase;
    color: #2A0E49;
    display: block;
    text-decoration: none;
    transition: 0.5s ease;
    &:hover {
      color: #DBB3FE;
    }
  }
  h4 {
    font-weight: 700;
    font-size: 18px;
    line-height: 25px;
    color: #2A0E49;
    margin-bottom: 10px;
  }
  ul {
    li {
      cursor: pointer;
      font-weight: 400;
      font-size: 15px;
      line-height: 1;
      color: #725E89;
      margin-bottom: 10px;
      transition: 0.5s ease;
      @media(min-width:992px){
        font-size: 18px;
        line-height: 25px;
      }
      &:hover {
        color: #2A0E49;
      }
    }
  }
  &-safety {
    margin-top: 40px;
    @media(min-width:768px){
      width: 298px;
      margin: 0;
      position: absolute;
      bottom: 0;
      right: 30px;
    }
    @media(min-width:1400px){
      transform: translate(50%, 0);
      right: 100px;
    }
    p {
      font-weight: 400;
      font-size: 18px;
      line-height: 25px;
      color: #2A0E49;
      margin-bottom: 20px;
    }
    &>div {
      display: flex;
      justify-content: space-between;
    }
  }
}
</style>